InformationRegisters/ОчередьВыгрузкиPDM.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОчередьВыгрузкиPDM</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОчередь</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗавершенОбмен</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоОбмена</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъектВыгрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
						<v8:Type>cfg:TaskRef.Задачи_ПКД</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
						<v8:Type>cfg:TaskRef.Задачи_РКД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СвязанныеВыгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОбменаPDM</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/омPDMНаСервере/Ext/Module.bsl
Функция ПодключитьБиблиотекуPDM() Экспорт
	
	
	Попытка
		МойОбъект = Новый COMОбъект("PDM_1C_COM.clPDM_1C_COM");
		
		
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат Ложь;
		Возврат ПодключитьсяККомпонентеИзМакета();
	КонецПопытки;
	//МойОбъект.message("Проба. Это такое пробное сообщение");
	Сообщить(МойОбъект.Login_PDM("User1C", "OJL314Pin", "PDM"));
	
	МойОбъект.Message(МойОбъект.Root_folder());
	Возврат Истина;
КонецФункции // ПодключитьБиблиотекуPDM()

Функция ПодключитьсяККомпонентеИзМакета()

	Попытка
	СсылкаНаАрхив  = ПоместитьВоВременноеХранилище(ПолучитьОбщийМакет("PDM_1C_COM"), Новый УникальныйИдентификатор);
	ПодключитьВнешнююКомпоненту(СсылкаНаАрхив, "PDM_1C_COM", ТипВнешнейКомпоненты.COM);	
	
	Исключение
		Возврат Ложь;
	КонецПопытки;
	 Возврат Истина;

КонецФункции // ПодключитьсяККоипонентеИзМакета()

Функция ПолучитьГабаритныйЧертежПоКоду(Код) Экспорт
	
	стВозврата = Новый Структура("Ссылка ,Наименование", Неопределено, "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГабаритныеЧертежи.Ссылка КАК Ссылка,
		|	ГабаритныеЧертежи.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ГабаритныеЧертежи КАК ГабаритныеЧертежи
		|ГДЕ
		|	ГабаритныеЧертежи.Код = &Код";
	
	Запрос.УстановитьПараметр("Код", Код);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(стВозврата ,Выборка);
	КонецЦикла;
	
	Возврат стВозврата;
	
КонецФункции // ПолучитьГабаритныйЧертежПоКоду()

Функция ПолучитьКомпозициюПоКоду(Код) Экспорт

	стВозврата = Новый Структура("Ссылка ,Наименование", Неопределено, "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Композиции.Ссылка КАК Ссылка,
		|	Композиции.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Композиции КАК Композиции
		|ГДЕ
		|	Композиции.Код = &Код";
	
	Запрос.УстановитьПараметр("Код", Код);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(стВозврата ,Выборка);
	КонецЦикла;
	
	Возврат стВозврата;
	

КонецФункции // ПолучитьКомпозициюПоКоду()

Функция ПолучитьКомплектПоКоду(Код) Экспорт

	стВозврата = Новый Структура("Ссылка ,Наименование", Неопределено, "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияКомплект.Ссылка КАК Ссылка,
		|	ИзделияКомплект.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ИзделияКомплект КАК ИзделияКомплект
		|ГДЕ
		|	ИзделияКомплект.Код = &Код";
	
	Запрос.УстановитьПараметр("Код", Код);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(стВозврата ,Выборка);
	КонецЦикла;
	
	Возврат стВозврата;
	

КонецФункции // ПолучитьКомпозициюПоКоду()

#Область PDM_очередь_на_сервере 

Процедура ПроверитьОчередьИЗапуститьСкрипт() Экспорт

//ДанныеИзОчереди структура ОбъектВыгрузки, ТипОбмена, УИД
	ДанныеИзОчереди = омОчередьПДМНаСервере.ПолучитьДанныеИзОчереди();
	ПодготовитьФайлыДляСкрипта(ДанныеИзОчереди);

КонецПроцедуры

Процедура ПодготовитьФайлыДляСкрипта(ДанныеИзОчереди)
	
	
	
КонецПроцедуры 

Процедура ОпросФайловОтвета()
	
	НастройкиВыгрузки = омPDMНаСервереПовтор.ПолучитьДанныеВыгрузки();
	
	КонтрольЗависшихДействий();
	
	КонтрольФайлов(НастройкиВыгрузки);
	
	ВызватьПаузу(НастройкиВыгрузки.ВремяОпросаФайлов);
	
	Если омОчередьПДМНаСервере.НуженКонтрольНовыхФайловОтвета() Тогда
		ОпросФайловОтвета();	
	КонецЕсли;

КонецПроцедуры

Процедура КонтрольФайлов(НастройкиВыгрузки)

	НайденныеФайлы = НайтиФайлы(НастройкиВыгрузки.ПутьКФайлуЗагрузки, "*.txt");
	
	Для Каждого Файл Из НайденныеФайлы Цикл
		
		Если Файл.ЭтоФайл() Тогда
			
			РазборФайла(Файл);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура РазборФайла(Файл)

	мДанныеИмяФайла = СтрРазделить(Файл.ИмяБезРасширения, "_");
	
	Если мДанныеИмяФайла.Количество() = 2 Тогда
	
		ИмяПрефикса = "";	
	
	Иначе
	
		ИмяПрефикса = мДанныеИмяФайла[0];
		
	КонецЕсли;
	
	Текст = Новый ЧтениеТекста(Файл.ПолноеИмя(), КодировкаТекста.ANSI); 
	
	МассивСтрок = Новый Массив;
	
	СтрокаФайла = Текст.ПрочитатьСтроку();
	Если НЕ СтрокаФайла = Неопределено Тогда
		МассивСтрок.Добавить(СтрокаФайла);	
	КонецЕсли;
	
	Пока СтрокаФайла <> Неопределено Цикл // строки читаются до символа перевода строки
		
		СтрокаФайла = Текст.ПрочитатьСтроку();
		Если НЕ СтрокаФайла = Неопределено Тогда
			МассивСтрок.Добавить(СтрокаФайла);	
		КонецЕсли;
		
	КонецЦикла;
	
	Файл.Удалить();
	
	Если ИмяПрефикса = "" Тогда
		ИзменилсяКомплект(МассивСтрок, мДанныеИмяФайла);
	ИначеЕсли ИмяПрефикса = "MPC" Тогда
		ЗабратьПраваКомпозиции(МассивСтрок, мДанныеИмяФайла);
	ИначеЕсли ИмяПрефикса = "SPC" Тогда
		РаздатьПраваКомпозиции(МассивСтрок, мДанныеИмяФайла);
	ИначеЕсли ИмяПрефикса = "UP" Тогда
		ЗабратьПраваКомплект(МассивСтрок, мДанныеИмяФайла);
	ИначеЕсли ИмяПрефикса = "MP" Тогда
		ЗабратьПраваКомплект(МассивСтрок, мДанныеИмяФайла);
	ИначеЕсли ИмяПрефикса = "TT" Тогда
		ИзменилсяПереносТЗ(МассивСтрок, мДанныеИмяФайла);
	ИначеЕсли ИмяПрефикса = "GCS" Тогда
		ИзменилсяСтатусГЧ(МассивСтрок, мДанныеИмяФайла);
	ИначеЕсли ИмяПрефикса = "C" Тогда
		ИзменилсяКомпозиция(МассивСтрок, мДанныеИмяФайла);
	ИначеЕсли ИмяПрефикса = "K" Тогда
		ИзменилсяКонструктор(МассивСтрок, мДанныеИмяФайла);
	ИначеЕсли ИмяПрефикса = "G" Тогда
		ИзменилсяГЧ(МассивСтрок, мДанныеИмяФайла);
	ИначеЕсли ИмяПрефикса = "P" Тогда
		ИзменилсяПроект(МассивСтрок, мДанныеИмяФайла);
	Иначе
		ЛогОшибок("Неизвестный префикс", Файл.ИмяБезРасширения);
		
	КонецЕсли;
	

КонецПроцедуры              

Процедура ЗабратьПраваКомпозиции(МассивСтрок, мДанныеИмяФайла)

	

КонецПроцедуры

Процедура РаздатьПраваКомпозиции(МассивСтрок, мДанныеИмяФайла)

	

КонецПроцедуры

Процедура РаздатьПраваКомплект(МассивСтрок, мДанныеИмяФайла)

	

КонецПроцедуры

Процедура ЗабратьПраваКомплект(МассивСтрок, мДанныеИмяФайла)

	

КонецПроцедуры

Процедура ИзменилсяПереносТЗ(МассивСтрок, мДанныеИмяФайла)

	

КонецПроцедуры

Процедура ИзменилсяСтатусГЧ(МассивСтрок, мДанныеИмяФайла)

	

КонецПроцедуры

Процедура ИзменилсяКомпозиция(МассивСтрок, мДанныеИмяФайла)

	

КонецПроцедуры

Процедура ИзменилсяКонструктор(МассивСтрок, мДанныеИмяФайла)

	

КонецПроцедуры

Процедура ИзменилсяГЧ(МассивСтрок, мДанныеИмяФайла)

	

КонецПроцедуры

Процедура ИзменилсяКомплект(МассивСтрок, мДанныеИмяФайла)

	

КонецПроцедуры

Процедура ИзменилсяПроект(МассивСтрок, мДанныеИмяФайла)

	

КонецПроцедуры

Процедура ЛогОшибок(ОписаниеОшибки, ИмяФайла)

	

КонецПроцедуры



Процедура КонтрольЗависшихДействий()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОчередьВыгрузкиPDM.УИД КАК УИД,
		|	ОчередьВыгрузкиPDM.СчетчикДействий КАК СчетчикДействий
		|ИЗ
		|	РегистрСведений.ОчередьВыгрузкиPDM КАК ОчередьВыгрузкиPDM
		|ГДЕ
		|	ОчередьВыгрузкиPDM.НачалоОбмена < &НачалоОбмена
		|	И ОчередьВыгрузкиPDM.ЗавершенОбмен = ДАТАВРЕМЯ(1, 1, 1)";
	
	Запрос.УстановитьПараметр("НачалоОбмена", ТекущаяДата() - 300);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЦикла;
	
КонецПроцедуры 

#Область ОбработкаКоманд


	
#КонецОбласти


#КонецОбласти
